CSI API ETABS v1
cDCoIndian_IS_456_2000.GetOverwrite Method
 Retrieves the value of a concrete design overwrite item.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetOverwrite(
	string Name,
	int Item,
	ref double Value,
	ref bool ProgDet
)
Function GetOverwrite (
	Name As String,
	Item As Integer,
	ByRef Value As Double,
	ByRef ProgDet As Boolean
) As Integer
Dim instance As cDCoIndian_IS_456_2000
Dim Name As String
Dim Item As Integer
Dim Value As Double
Dim ProgDet As Boolean
Dim returnValue As Integer
returnValue = instance.GetOverwrite(Name,
	Item, Value, ProgDet)
int GetOverwrite(
	String^ Name,
	int Item,
	double% Value,
	bool% ProgDet
)
abstract GetOverwrite :
        Name : string *
        Item : int *
        Value : float byref *
        ProgDet : bool byref -> int
Parameters
Name
Type: System.String
 The name of a frame object with a concrete frame design procedure.
Item
Type: System.Int32
 This is an integer between 1 and 21, inclusive, indicating the overwrite item considered.
Framing type
Live load reduction factor
Unbraced length ratio, Major
Unbraced length ratio, Minor
Effective length factor sway, K Major
Effective length factor sway, K Minor
Moment coefficient, Cm Major
Moment coefficient, Cm Minor
Nonsway moment factor, Db Major
Nonsway moment factor, Db Minor
Sway moment factor, Ds Major
Sway moment factor, Ds Minor
Top rebar area of a beam at the left end (I-end)
Bottom rebar area of a beam at the left end (I-end)
Top rebar area of a beam at the right end (J-end)
Bottom rebar area of a beam at the right end (J-end)
Effective length factor braced, K Major
Effective length factor braced, K Minor
Q Factor in Global X Dir
Q Factor in Global Y Dir
Consider Minimum Eccentricity
Value
Type: System.Double
 The value of the considered overwrite item.
 Framing type
0 = Program Default
1 = Ductile
2 = Ordinary
3 = Non-sway
 Live load reduction factor
 Value >= 0; 0 means use program determined value
 Unbraced length ratio, Major
 Value >= 0; 0 means use program determined value
 Unbraced length ratio, Minor
 Value >= 0; 0 means use program determined value
 Effective length factor sway, K Major
 Value >= 0; 0 means use program determined value
 Effective length factor sway, K Minor
 Value >= 0; 0 means use program determined value
 Moment coefficient, Cm Major
 Value >= 0; 0 means use program determined value
 Moment coefficient, Cm Minor
 Value >= 0; 0 means use program determined value
 Nonsway moment factor, Db Major
 Value >= 0; 0 means use program determined value
 Nonsway moment factor, Db Minor
 Value >= 0; 0 means use program determined value
 Sway moment factor, Ds Major
 Value >= 0; 0 means use program determined value
 Sway moment factor, Ds Minor
 Value >= 0; 0 means use program determined value
 Top rebar area of a beam at the left end (I-end)
 Value >= 0; 0 means use program determined value
 Bottom rebar area of a beam at the left end (I-end)
 Value >= 0; 0 means use program determined value
 Top rebar area of a beam at the right end (J-end)
 Value >= 0; 0 means use program determined value
 Bottom rebar area of a beam at the right end (J-end)
 Value >= 0; 0 means use program determined value
 Effective length factor braced, K Major
 Value >= 0; 0 means use program determined value
 Effective length factor braced, K Minor
 Value >= 0; 0 means use program determined value
 Q Factor in Global X Dir
 Value >= 0; 0 means use program determined value
 Q Factor in Global Y Dir
 Value >= 0; 0 means use program determined value
 Consider Minimum Eccentricity
 0 = No
 Any other value = Yes
ProgDet
Type: System.Boolean
 If this item is True, the specified value is program determined.
Return Value
Type: Int32
 Returns zero if the item is successfully retrieved; otherwise it returns a nonzero value.
See Also
Reference
cDCoIndian_IS_456_2000 Interface
ETABSv1 Namespace